dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMcdslight_reg.h
/** \brief A44, Counter Limit Register */
#define MCDSLIGHT_MCX4_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_LMT*)0xFA010A44u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX4_LMT.
* To use register names with standard convension, please use MCDSLIGHT_MCX4_LMT.
*/
#define MCDSLIGHT_MCXLMT4 (MCDSLIGHT_MCX4_LMT)

/** \brief A48, Current Count Register */
#define MCDSLIGHT_MCX4_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CNT*)0xFA010A48u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX4_CNT.
* To use register names with standard convension, please use MCDSLIGHT_MCX4_CNT.
*/
#define MCDSLIGHT_MCXCNT4 (MCDSLIGHT_MCX4_CNT)

/** \brief A50, Counter Control Register */
#define MCDSLIGHT_MCX5_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CCL*)0xFA010A50u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX5_CCL.
* To use register names with standard convension, please use MCDSLIGHT_MCX5_CCL.
*/
#define MCDSLIGHT_MCXCCL5 (MCDSLIGHT_MCX5_CCL)

/** \brief A54, Counter Limit Register */
#define MCDSLIGHT_MCX5_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_LMT*)0xFA010A54u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX5_LMT.
* To use register names with standard convension, please use MCDSLIGHT_MCX5_LMT.
*/
#define MCDSLIGHT_MCXLMT5 (MCDSLIGHT_MCX5_LMT)

/** \brief A58, Current Count Register */
#define MCDSLIGHT_MCX5_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CNT*)0xFA010A58u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX5_CNT.
* To use register names with standard convension, please use MCDSLIGHT_MCX5_CNT.
*/
#define MCDSLIGHT_MCXCNT5 (MCDSLIGHT_MCX5_CNT)

/** \brief A60, Counter Control Register */
#define MCDSLIGHT_MCX6_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CCL*)0xFA010A60u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX6_CCL.
* To use register names with standard convension, please use MCDSLIGHT_MCX6_CCL.
*/
#define MCDSLIGHT_MCXCCL6 (MCDSLIGHT_MCX6_CCL)

/** \brief A64, Counter Limit Register */
#define MCDSLIGHT_MCX6_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_LMT*)0xFA010A64u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX6_LMT.
* To use register names with standard convension, please use MCDSLIGHT_MCX6_LMT.
*/
#define MCDSLIGHT_MCXLMT6 (MCDSLIGHT_MCX6_LMT)

/** \brief A68, Current Count Register */
#define MCDSLIGHT_MCX6_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CNT*)0xFA010A68u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX6_CNT.
* To use register names with standard convension, please use MCDSLIGHT_MCX6_CNT.
*/
#define MCDSLIGHT_MCXCNT6 (MCDSLIGHT_MCX6_CNT)

/** \brief A70, Counter Control Register */
#define MCDSLIGHT_MCX7_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CCL*)0xFA010A70u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX7_CCL.
* To use register names with standard convension, please use MCDSLIGHT_MCX7_CCL.
*/
#define MCDSLIGHT_MCXCCL7 (MCDSLIGHT_MCX7_CCL)

/** \brief A74, Counter Limit Register */
#define MCDSLIGHT_MCX7_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_LMT*)0xFA010A74u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX7_LMT.
* To use register names with standard convension, please use MCDSLIGHT_MCX7_LMT.
*/
#define MCDSLIGHT_MCXLMT7 (MCDSLIGHT_MCX7_LMT)

/** \brief A78, Current Count Register */
#define MCDSLIGHT_MCX7_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CNT*)0xFA010A78u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX7_CNT.
* To use register names with standard convension, please use MCDSLIGHT_MCX7_CNT.
*/
#define MCDSLIGHT_MCXCNT7 (MCDSLIGHT_MCX7_CNT)

/** \brief A80, Counter Control Register */
#define MCDSLIGHT_MCX8_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CCL*)0xFA010A80u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX8_CCL.
* To use register names with standard convension, please use MCDSLIGHT_MCX8_CCL.
*/
#define MCDSLIGHT_MCXCCL8 (MCDSLIGHT_MCX8_CCL)

/** \brief A84, Counter Limit Register */
#define MCDSLIGHT_MCX8_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_LMT*)0xFA010A84u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX8_LMT.
* To use register names with standard convension, please use MCDSLIGHT_MCX8_LMT.
*/
#define MCDSLIGHT_MCXLMT8 (MCDSLIGHT_MCX8_LMT)

/** \brief A88, Current Count Register */
#define MCDSLIGHT_MCX8_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CNT*)0xFA010A88u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX8_CNT.
* To use register names with standard convension, please use MCDSLIGHT_MCX8_CNT.
*/
#define MCDSLIGHT_MCXCNT8 (MCDSLIGHT_MCX8_CNT)

/** \brief A90, Counter Control Register */
#define MCDSLIGHT_MCX9_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CCL*)0xFA010A90u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX9_CCL.
* To use register names with standard convension, please use MCDSLIGHT_MCX9_CCL.
*/
#define MCDSLIGHT_MCXCCL9 (MCDSLIGHT_MCX9_CCL)

/** \brief A94, Counter Limit Register */
#define MCDSLIGHT_MCX9_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_LMT*)0xFA010A94u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX9_LMT.
* To use register names with standard convension, please use MCDSLIGHT_MCX9_LMT.
*/
#define MCDSLIGHT_MCXLMT9 (MCDSLIGHT_MCX9_LMT)

/** \brief A98, Current Count Register */
#define MCDSLIGHT_MCX9_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CNT*)0xFA010A98u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX9_CNT.
* To use register names with standard convension, please use MCDSLIGHT_MCX9_CNT.
*/
#define MCDSLIGHT_MCXCNT9 (MCDSLIGHT_MCX9_CNT)

/** \brief AA0, Counter Control Register */
#define MCDSLIGHT_MCX10_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CCL*)0xFA010AA0u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX10_CCL.
* To use register names with standard convension, please use MCDSLIGHT_MCX10_CCL.
*/
#define MCDSLIGHT_MCXCCL10 (MCDSLIGHT_MCX10_CCL)

/** \brief AA4, Counter Limit Register */
#define MCDSLIGHT_MCX10_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_LMT*)0xFA010AA4u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX10_LMT.
* To use register names with standard convension, please use MCDSLIGHT_MCX10_LMT.
*/
#define MCDSLIGHT_MCXLMT10 (MCDSLIGHT_MCX10_LMT)

/** \brief AA8, Current Count Register */
#define MCDSLIGHT_MCX10_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CNT*)0xFA010AA8u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX10_CNT.
* To use register names with standard convension, please use MCDSLIGHT_MCX10_CNT.
*/
#define MCDSLIGHT_MCXCNT10 (MCDSLIGHT_MCX10_CNT)

/** \brief AB0, Counter Control Register */
#define MCDSLIGHT_MCX11_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CCL*)0xFA010AB0u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX11_CCL.
* To use register names with standard convension, please use MCDSLIGHT_MCX11_CCL.
*/
#define MCDSLIGHT_MCXCCL11 (MCDSLIGHT_MCX11_CCL)

