dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMcdslight_reg.h
/** \brief 28B4, Action Definition Register 13 */
#define MCDSLIGHT_TCXACT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA0128B4u)

/** \brief 28B8, Action Definition Register 14 */
#define MCDSLIGHT_TCXACT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA0128B8u)

/** \brief 28BC, Action Definition Register 15 */
#define MCDSLIGHT_TCXACT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA0128BCu)

/** \brief 28C0, Action Definition Register 16 */
#define MCDSLIGHT_TCXACT16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA0128C0u)

/** \brief 28C4, Action Definition Register 17 */
#define MCDSLIGHT_TCXACT17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA0128C4u)

/** \brief 28C8, Action Definition Register 18 */
#define MCDSLIGHT_TCXACT18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA0128C8u)

/** \brief 28CC, Action Definition Register 19 */
#define MCDSLIGHT_TCXACT19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA0128CCu)

/** \brief 28D0, Action Definition Register 20 */
#define MCDSLIGHT_TCXACT20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA0128D0u)

/** \brief 28D4, Action Definition Register 21 */
#define MCDSLIGHT_TCXACT21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA0128D4u)

/** \brief 28D8, Action Definition Register 22 */
#define MCDSLIGHT_TCXACT22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA0128D8u)

/** \brief 28DC, Action Definition Register 23 */
#define MCDSLIGHT_TCXACT23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA0128DCu)

/** \brief 3000, Comparator Bound Register 0 */
#define MCDSLIGHT_TCXIP0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXIP_BND*)0xFA013000u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXIP0_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXIP0_BND.
*/
#define MCDSLIGHT_TCXIPBND0 (MCDSLIGHT_TCXIP0_BND)

/** \brief 3004, Comparator Range Register 0 */
#define MCDSLIGHT_TCXIP0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXIP_RNG*)0xFA013004u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXIP0_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXIP0_RNG.
*/
#define MCDSLIGHT_TCXIPRNG0 (MCDSLIGHT_TCXIP0_RNG)

/** \brief 3010, Comparator Bound Register 1 */
#define MCDSLIGHT_TCXIP1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXIP_BND*)0xFA013010u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXIP1_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXIP1_BND.
*/
#define MCDSLIGHT_TCXIPBND1 (MCDSLIGHT_TCXIP1_BND)

/** \brief 3014, Comparator Range Register 1 */
#define MCDSLIGHT_TCXIP1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXIP_RNG*)0xFA013014u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXIP1_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXIP1_RNG.
*/
#define MCDSLIGHT_TCXIPRNG1 (MCDSLIGHT_TCXIP1_RNG)

/** \brief 3020, Comparator Bound Register 2 */
#define MCDSLIGHT_TCXIP2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXIP_BND*)0xFA013020u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXIP2_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXIP2_BND.
*/
#define MCDSLIGHT_TCXIPBND2 (MCDSLIGHT_TCXIP2_BND)

/** \brief 3024, Comparator Range Register 2 */
#define MCDSLIGHT_TCXIP2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXIP_RNG*)0xFA013024u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXIP2_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXIP2_RNG.
*/
#define MCDSLIGHT_TCXIPRNG2 (MCDSLIGHT_TCXIP2_RNG)

/** \brief 3030, Comparator Bound Register 3 */
#define MCDSLIGHT_TCXIP3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXIP_BND*)0xFA013030u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXIP3_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXIP3_BND.
*/
#define MCDSLIGHT_TCXIPBND3 (MCDSLIGHT_TCXIP3_BND)

/** \brief 3034, Comparator Range Register 3 */
#define MCDSLIGHT_TCXIP3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXIP_RNG*)0xFA013034u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXIP3_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXIP3_RNG.
*/
#define MCDSLIGHT_TCXIPRNG3 (MCDSLIGHT_TCXIP3_RNG)

/** \brief 3040, Comparator Bound Register 4 */
#define MCDSLIGHT_TCXIP4_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXIP_BND*)0xFA013040u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXIP4_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXIP4_BND.
*/
#define MCDSLIGHT_TCXIPBND4 (MCDSLIGHT_TCXIP4_BND)

/** \brief 3044, Comparator Range Register 4 */
#define MCDSLIGHT_TCXIP4_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXIP_RNG*)0xFA013044u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXIP4_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXIP4_RNG.
*/
#define MCDSLIGHT_TCXIPRNG4 (MCDSLIGHT_TCXIP4_RNG)

/** \brief 3050, Comparator Bound Register 5 */
#define MCDSLIGHT_TCXIP5_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXIP_BND*)0xFA013050u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXIP5_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXIP5_BND.
*/
#define MCDSLIGHT_TCXIPBND5 (MCDSLIGHT_TCXIP5_BND)

/** \brief 3054, Comparator Range Register 5 */
#define MCDSLIGHT_TCXIP5_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXIP_RNG*)0xFA013054u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXIP5_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXIP5_RNG.
*/
#define MCDSLIGHT_TCXIPRNG5 (MCDSLIGHT_TCXIP5_RNG)

/** \brief 4000, Debug Status Register */
#define MCDSLIGHT_TCYDCSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYDCSTS*)0xFA014000u)

/** \brief 4008, Current Instruction Pointer */
#define MCDSLIGHT_TCYCIP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYCIP*)0xFA014008u)

/** \brief 400C, Compact Function Trace Register */
#define MCDSLIGHT_TCYCFT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYCFT*)0xFA01400Cu)

